#include <iostream>
#include <iomanip>
#include <cmath>

using namespace std;

int main() {
	double x, x2, dx, eps, a = 0, R = 0, S = 0;
	int n = 0;

	cout << "x = "; cin >> x;
	cout << "x2 = "; cin >> x2;
	cout << "dx = "; cin >> dx;
	cout << "eps = "; cin >> eps;

	cout << fixed;
	cout << "-----------------------------------------------------------" << endl;
	cout << "|" << setw(10) << "x" << " |"
		<< setw(15) << "exp(x*x)" << " |"
		<< setw(15) << "S" << " |"
		<< setw(10) << "n" << " |"
		<< endl;
	cout << "-----------------------------------------------------------" << endl;

	while (x <= x2)  // Цикл для х
	{
		n = 0; // Початкове значення n
		a = 1; // Перше значення з циклу при n = 0
		S = a; // Перше значення з суми при n = 0
		do {
			n++; // Збільшуємо n
			R = x*x / n; // Вираховуємо коефіцієнт рекурсивності
			a *= R; // Отримуємо наступний член в рядку суми за допомогою множення минулого на коефіцієнт 
			S += a; // Отримуємо нову суму шляхом додавання тільки отриманого члена до минулої суми
		} while (abs(a) >= eps);
		cout << "|" << setw(10) << setprecision(2) << x << " |"
			<< setw(15) << setprecision(2) << exp(x*x) << " |"  // Тут виводиться значення всієї функції
			<< setw(15) << setprecision(2) << S << " |"
			<< setw(10) << n << " |"
			<< endl;
		x += dx;
	}
	cout << "-------------------------------------------------------------" << endl;
	return 0;
}

